[{"name":"Stephen King","img":"https://images-na.ssl-images-amazon.com/images/I/31EHu55wVtL._UX250_.jpg","bio":"Stephen King is the author of more than fifty books, all of them worldwide bestsellers. Among his most recent are the Dark Tower novels, Cell, From a Buick 8, Everything's Eventual, Hearts in Atlantis, The Girl Who Loved Tom Gordon, and Bag of Bones. His acclaimed nonfiction book, On Writing, was also a bestseller. He is the recipient of the 2003 National Book Foundation Medal for Distinguished Contribution to American Letters. He lives in Bangor, Maine, with his wife, novelist Tabitha King.","id":0},{"name":"Ernest Hemingway","img":"https://images-na.ssl-images-amazon.com/images/I/412cd1neS8L._UX250_.jpg","bio":"Ernest Hemingway was born in 1899. His father was a doctor and he was the second of six children. Their home was at Oak Park, a Chicago suburb. In 1917, Hemingway joined the Kansas City Star as a cub reporter. The following year, he volunteered as an ambulance driver on the Italian front, where he was badly wounded but decorated for his services. He returned to America in 1919, and married in 1921. In 1922, he reported on the Greco-Turkish war before resigning from journalism to devote himself to fiction. He settled in Paris where he renewed his earlier friendships with such fellow-American expatriates as Ezra Pound and Gertrude Stein. Their encouragement and criticism were to play a valuable part in the formation of his style.Hemingway's first two published works were Three Stories and Ten Poems and In Our Time but it was the satirical novel, The Torrents of Spring, that established his name more widely. His international reputation was firmly secured by his next three books; Fiesta, Men Without Women and A Farewell to Arms. He was passionately involved with bullfighting, big-game hunting and deep-sea fishing and his writing reflected this. He visited Spain during the Civil War and described his experiences in the bestseller, For Whom the Bell Tolls.His direct and deceptively simple style of writing spawned generations of imitators but no equals. Recognition of his position in contemporary literature came in 1954 when he was awarded the Nobel Prize for Literature, following the publication of The Old Man and the Sea. He died in 1961.","id":1},{"name":"Andy Weir","img":"https://images-na.ssl-images-amazon.com/images/I/91NdG2aRQRL._UX250_.jpg","bio":"ANDY WEIR was first hired as a programmer for a national laboratory at age fifteen and has been working as a software engineer ever since. He is also a lifelong space nerd and a devoted hobbyist of subjects like relativistic physics, orbital mechanics, and the history of manned spaceflight.","id":2},{"name":"J.K. Rowling","img":"https://images-na.ssl-images-amazon.com/images/I/819zleU4ByL._UX250_.jpg","bio":"J.K. Rowling is the author of the bestselling Harry Potter series of seven books, published between 1997 and 2007, which have sold over 450 million copies worldwide, are distributed in more than 200 territories, translated into 74 languages, and have been turned into eight blockbuster films. She has also written two small volumes, which appear as the titles of Harry's schoolbooks within the novels. Fantastic Beasts and Where to Find Them and Quidditch Through The Ages were published by Bloomsbury Children's Books in March 2001 in aid of Comic Relief. In December 2008, The Tales of Beedle the Bard was published in aid of the Children's High Level Group, and quickly became the fastest selling book of the year. As well as an OBE for services to children's literature, J.K. Rowling is the recipient of numerous awards and honorary degrees including the Prince of Asturias Award for Concord, France's Légion d'Honneur, and the Hans Christian Andersen Award, and she has been a Commencement Speaker at Harvard University USA. She supports a wide number of charitable causes through her charitable trust Volant, and is the founder of Lumos, a charity working to transform the lives of disadvantaged children","id":3},{"name":"Walter Isaacson","img":"https://images-na.ssl-images-amazon.com/images/I/31i6NOvyEtL._UX250_.jpg","bio":"Walter Isaacson, the CEO of the Aspen Institute, has been chairman of CNN and the managing editor of Time magazine. He is the author of Benjamin Franklin: An American Life and of Kissinger: A Biography, and the coauthor of The Wise Men: Six Friends and the World They Made. He lives in Washington, D.C., with his wife and daughter.","id":4}]