[{"title":"Harry Potter and the Philosopher's Stone: 1/7 (Harry Potter 1)","author":3,"img":"http://ecx.images-amazon.com/images/I/51uu8OqY0ZL._SX332_BO1,204,203,200_.jpg","desc":"Harry Potter has never even heard of Hogwarts when the letters start dropping on the doormat at number four, Privet Drive. Addressed in green ink on yellowish parchment with a purple seal, they are swiftly confiscated by his grisly aunt and uncle. Then, on Harry's eleventh birthday, a great beetle-eyed giant of a man called Rubeus Hagrid bursts in with some astonishing news: Harry Potter is a wizard, and he has a place at Hogwarts School of Witchcraft and Wizardry. An incredible adventure is about to begin!","genre":"Fantasy","id":0},{"title":"Harry Potter and the Chamber of Secrets: 2/7 (Harry Potter 2)","author":3,"img":"http://ecx.images-amazon.com/images/I/516yfEpcJwL._SX324_BO1,204,203,200_.jpg","desc":"Harry Potter's summer has included the worst birthday ever, doomy warnings from a house-elf called Dobby, and rescue from the Dursleys by his friend Ron Weasley in a magical flying car! Back at Hogwarts School of Witchcraft and Wizardry for his second year, Harry hears strange whispers echo through empty corridors - and then the attacks start. Students are found as though turned to stone . Dobby's sinister predictions seem to be coming true.","genre":"Fantasy","id":1},{"title":"Harry Potter and the Prisoner of Azkaban: 3/7 (Harry Potter 3)","author":3,"img":"http://ecx.images-amazon.com/images/I/51TldsI1%2BSL._SX332_BO1,204,203,200_.jpg","desc":"HWhen the Knight Bus crashes through the darkness and screeches to a halt in front of him, it's the start of another far from ordinary year at Hogwarts for Harry Potter. Sirius Black, escaped mass-murderer and follower of Lord Voldemort, is on the run - and they say he is coming after Harry. In his first ever Divination class, Professor Trelawney sees an omen of death in Harry's tea leaves . But perhaps most terrifying of all are the Dementors patrolling the school grounds, with their soul-sucking kiss.","genre":"Fantasy","id":2},{"title":"Harry Potter and the Goblet of Fire: 4/7 (Harry Potter 4)","author":3,"img":"http://ecx.images-amazon.com/images/I/51FefEwWQUL._SX332_BO1,204,203,200_.jpg","desc":"The Triwizard Tournament is to be held at Hogwarts. Only wizards who are over seventeen are allowed to enter - but that doesn't stop Harry dreaming that he will win the competition. Then at Hallowe'en, when the Goblet of Fire makes its selection, Harry is amazed to find his name is one of those that the magical cup picks out. He will face death-defying tasks, dragons and Dark wizards, but with the help of his best friends, Ron and Hermione, he might just make it through - alive!","genre":"Fantasy","id":3},{"title":"Harry Potter and the Order of the Phoenix: 5/7 (Harry Potter 5)","author":3,"img":"http://ecx.images-amazon.com/images/I/51BCJOshV1L._SX332_BO1,204,203,200_.jpg","desc":"Dark times have come to Hogwarts. After the Dementors' attack on his cousin Dudley, Harry Potter knows that Voldemort will stop at nothing to find him. There are many who deny the Dark Lord's return, but Harry is not alone: a secret order gathers at Grimmauld Place to fight against the Dark forces. Harry must allow Professor Snape to teach him how to protect himself from Voldemort's savage assaults on his mind. But they are growing stronger by the day and Harry is running out of time.","genre":"Fantasy","id":4},{"title":"Harry Potter and the Half-Blood Prince: 6/7 (Harry Potter 6)","author":3,"img":"http://ecx.images-amazon.com/images/I/5138SLC2gIL._SX332_BO1,204,203,200_.jpg","desc":"When Dumbledore arrives at Privet Drive one summer night to collect Harry Potter, his wand hand is blackened and shrivelled, but he does not reveal why. Secrets and suspicion are spreading through the wizarding world, and Hogwarts itself is not safe. Harry is convinced that Malfoy bears the Dark Mark: there is a Death Eater amongst them. Harry will need powerful magic and true friends as he explores Voldemort's darkest secrets, and Dumbledore prepares him to face his destiny.","genre":"Fantasy","id":5},{"title":"Harry Potter and the Deathly Hallows: 7/7 (Harry Potter 7)","author":3,"img":"http://ecx.images-amazon.com/images/I/51A-yBq5bcL._SX344_BO1,204,203,200_.jpg","desc":"As he climbs into the sidecar of Hagrid's motorbike and takes to the skies, leaving Privet Drive for the last time, Harry Potter knows that Lord Voldemort and the Death Eaters are not far behind. The protective charm that has kept Harry safe until now is now broken, but he cannot keep hiding. The Dark Lord is breathing fear into everything Harry loves, and to stop him Harry will have to find and destroy the remaining Horcruxes. The final battle must begin - Harry must stand and face his enemy.","genre":"Fantasy","id":6},{"title":"End of Watch","author":0,"img":"http://ecx.images-amazon.com/images/I/41myQ39kziL._SX323_BO1,204,203,200_.jpg","desc":"Retired Detective Bill Hodges now runs a two-person firm called Finders Keepers with his partner Holly Gibney. They met in the wake of the 'Mercedes Massacre' when a queue of people was run down by the diabolical killer Brady Hartsfield.","genre":"Thrillers","id":7},{"title":"Awaken","author":0,"img":"http://ecx.images-amazon.com/images/I/51LyxMZDmXL._SX331_BO1,204,203,200_.jpg","desc":"Delve deep into the creative mind for new legends and visionary underworlds. Enjoy five short stories of madness and terror from Stephen King. Do you awaken after bad dreams and feel the fear still lingering in the room? Become aware in these vivid fantasies as you remember those strong feelings again.","genre":"Thrillers","id":8},{"title":"The Bazaar of Bad Dreams","author":0,"img":"http://ecx.images-amazon.com/images/I/51tR6%2Bp5KSL._SX323_BO1,204,203,200_.jpg","desc":"A generous collection of thrilling stories - some brand new, some published in magazines, all entirely brilliant and assembled in one book for the first time - with a wonderful bonus: in addition to his introduction to the whole collection, King gives readers a fascinating introduction to each story with autobiographical comments on their origins and motivation...","genre":"Thrillers","id":9},{"title":"The Martian","author":2,"img":"http://ecx.images-amazon.com/images/I/51Rad1zFU3L._SX315_BO1,204,203,200_.jpg","desc":"I’m stranded on Mars.","genre":"Fiction","id":10},{"title":"Old Man and the Sea","author":1,"img":"http://ecx.images-amazon.com/images/I/51i1lQ3t42L._SX318_BO1,204,203,200_.jpg","desc":"The last novel Ernest Hemingway saw published, The Old Man and the Sea has proved itself to be one of the enduring works of American fiction. It is the story of an old Cuban fisherman and his supreme ordeal: a relentless, agonizing battle with a giant marlin far out in the Gulf Stream. Using the simple, powerful language of a fable, Hemingway takes the timeless themes of courage in the face of defeat and personal triumph won from loss and transforms them into a magnificent twentieth-century classic.","genre":"Fiction","id":11},{"title":"For Whom the Bell Tolls","author":1,"img":"http://ecx.images-amazon.com/images/I/51YULFv5rSL._SX319_BO1,204,203,200_.jpg","desc":"Tn 1937 Ernest Hemingway traveled to Spain to cover the civil war there for the North American Newspaper Alliance. Three years later he completed the greatest novel to emerge from “the good fight,” For Whom the Bell Tolls. The story of Robert Jordan, a young American in the International Brigades attached to an antifascist guerilla unit in the mountains of Spain, it tells of loyalty and courage, love and defeat, and the tragic death of an ideal. In his portrayal of Jordan's love for the beautiful Maria and his...","genre":"Fiction","id":12},{"title":"Death in the Afternoon","author":1,"img":"http://ecx.images-amazon.com/images/I/51yQOL6D-jL._SX319_BO1,204,203,200_.jpg","desc":"Still considered one of the best books ever written about bullfighting, Death in the Afternoon is an impassioned look at the sport by one of its true aficionados. It reflects Hemingway's conviction that bullfighting was more than mere sport and reveals a rich source of inspiration for his art. The unrivaled drama of bullfighting, with its rigorous combination of athleticism and artistry, and its requisite display of grace under pressure, ignited Hemingway's imagination.","genre":"Fiction","id":13},{"title":"Steve Jobs: The Exclusive Biography","author":4,"img":"http://ecx.images-amazon.com/images/I/41n1edvVlLL._SX317_BO1,204,203,200_.jpg","desc":"Based on more than forty interviews with Steve Jobs conducted over two years - as well as interviews with more than a hundred family members, friends, adversaries, competitors, and colleagues - this is the acclaimed, internationally bestselling biography of the ultimate icon of inventiveness. Walter Isaacson tells the story of the rollercoaster life and searingly intense personality of creative entrepreneur whose passion for perfection and ferocious drive revolutionized six industries: personal computers, animated movies,music, phones, tablet computing, and digital publishing. Although Jobs cooperated with this book, he asked for no control over what was written, nor even the right to read it before it was published. He put nothing off limits. He encouraged the people he knew to speak honestly.","genre":"Biography","id":14},{"title":"Einstein: His Life and Universe","author":4,"img":"http://ecx.images-amazon.com/images/I/511c-IEQriL._SX321_BO1,204,203,200_.jpg","desc":"Einstein is the great icon of our age: the kindly refugee from oppression whose wild halo of hair, twinkling eyes, engaging humanity and extraordinary brilliance made his face a symbol and his name a synonym for genius. He was a rebel and nonconformist from boyhood days. His character, creativity and imagination were related, and they drove both his life and his science. In this marvellously clear and accessible narrative, Walter Isaacson explains how his mind worked and the mysteries of the universe that he discovered. Einstein's success came from questioning conventional wisdom and marvelling at mysteries that struck others as mundane. ","genre":"Biography","id":15}]